app/views/job_matches/index.html.erb

        <p class="card-text"> <strong>Hourly Rate($):</strong> <%= job_match.job_posting.experience_level_hourly_rate.hourly_rates %> </p>
        <p class="card-text"> <strong>Freelancer:</strong> <%= job_match.freelancer.first_name %>&nbsp;<%= job_match.freelancer.last_name %> </p>
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 ORDER BY "freelancers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]