app/views/job_postings/list.html.erb

        <% if (freelancer_signed_in?) %>
                <% @job_match = JobMatch.find_by(job_posting_id: job_post.id, freelancer_id: current_freelancer.id)
---
SELECT  "job_matches".* FROM "job_matches" WHERE "job_matches"."job_posting_id" = $1 AND "job_matches"."freelancer_id" = $2 LIMIT $3  [["job_posting_id", 6], ["freelancer_id", 1], ["LIMIT", 1]]

                <% end %>
                <% @save_job = SaveJobBucket.find_by(job_posting_id: job_post.id, freelancer_id: current_freelancer.id)
---
SELECT  "save_job_buckets".* FROM "save_job_buckets" WHERE "save_job_buckets"."job_posting_id" = $1 AND "save_job_buckets"."freelancer_id" = $2 LIMIT $3  [["job_posting_id", 6], ["freelancer_id", 1], ["LIMIT", 1]]