app/views/job_postings/new.html.erb

        <%= f.label :what_programming_languages_do_you_require? %><br />
        <% @expertises.select{|x| x.name == "Programming Language"}.first.expertise_detail.each do |expertise| %>
---
SELECT "expertise_details".* FROM "expertise_details" WHERE "expertise_details"."expertise_id" = $1  [["expertise_id", 10]]
SELECT "expertises".* FROM "expertises"