app/controllers/freelancers_controller.rb

  def index
      @freelancers = Freelancer.all
---
SELECT "freelancers".* FROM "freelancers"

  def saved_candidates
      @freelancers = Freelancer.joins("INNER JOIN save_freelancer_buckets ON save_freelancer_buckets.freelancer_id = freelancers.id").where(["save_freelancer_buckets.hirer_id = ?" , current_hirer.id])
---
SELECT "freelancers".* FROM "freelancers" INNER JOIN save_freelancer_buckets ON save_freelancer_buckets.freelancer_id = freelancers.id WHERE (save_freelancer_buckets.hirer_id = 1)

  def register
        @freelancer = Freelancer.find(current_freelancer.id)
        if @freelancer.professional_title.nil? || @freelancer.professional_title.empty?
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 ORDER BY "freelancers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
        @freelancer = Freelancer.find(params[:id])
        @category = JobCategory.find(@freelancer.job_category_id)
        @experience = ExperienceLevelHourlyRate.find(@freelancer.experience_level_hourly_rate_id)
        @payment = PaymentType.find(@freelancer.payment_type_id)
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "job_categories".* FROM "job_categories" WHERE "job_categories"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  "experience_level_hourly_rates".* FROM "experience_level_hourly_rates" WHERE "experience_level_hourly_rates"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "payment_types".* FROM "payment_types" WHERE "payment_types"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def register_profile
          @freelancer = Freelancer.find(current_freelancer.id)
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 ORDER BY "freelancers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def register_expertise
          @freelancer = Freelancer.find(current_freelancer.id)
          @job_categories = JobCategory.all
          @experience_levels = ExperienceLevelHourlyRate.all
          @payment_types = PaymentType.all
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 ORDER BY "freelancers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "job_categories".* FROM "job_categories"
SELECT "experience_level_hourly_rates".* FROM "experience_level_hourly_rates"
SELECT "payment_types".* FROM "payment_types"

    def register_budget
          @freelancer = Freelancer.find(current_freelancer.id)
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 ORDER BY "freelancers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def save_profile
          @freelancer = Freelancer.find(current_freelancer.id)
          if !@freelancer.nil?
              @freelancer.update(freelancer_params)
---
SELECT  "freelancers".* FROM "freelancers" WHERE "freelancers"."id" = $1 ORDER BY "freelancers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "freelancers" SET "job_category_id" = $1, "experience_level_hourly_rate_id" = $2, "payment_type_id" = $3 WHERE "freelancers"."id" = $4  [["job_category_id", 22], ["experience_level_hourly_rate_id", 13], ["payment_type_id", 9], ["id", 1]]