app/controllers/job_matches_controller.rb

INSERT INTO "save_job_buckets" ("freelancer_id", "job_posting_id") VALUES ($1, $2) RETURNING "id"  [["freelancer_id", 1], ["job_posting_id", 6]]
---
  def save_job
        if (freelancer_signed_in?)
            @job_bucket = SaveJobBucket.new
            @job_bucket.freelancer_id = current_freelancer.id
            @job_bucket.job_posting_id = params[:job_id]
            @job_bucket.save

SELECT "job_matches".* FROM "job_matches" WHERE "job_matches"."freelancer_id" = $1 ORDER BY "job_matches"."id" ASC  [["freelancer_id", 1]]
SELECT "job_matches".* FROM "job_matches" WHERE "job_matches"."hirer_id" = $1 ORDER BY "job_matches"."id" ASC  [["hirer_id", 1]]
---
  def index
        if freelancer_signed_in?
          @job_matches = JobMatch.where(freelancer_id: current_freelancer.id).order(:id)
        end
        if hirer_signed_in?
          @job_matches = JobMatch.where(hirer_id: current_hirer.id).order(:id)