app/controllers/job_postings_controller.rb

        def index
                @job_posting = JobPosting.all
---
SELECT "job_postings".* FROM "job_postings"

        def list
                @job_posting = JobPosting.all
---
SELECT "job_postings".* FROM "job_postings"

        def saved_jobs
                @job_posting = JobPosting.joins("INNER JOIN save_job_buckets ON save_job_buckets.job_posting_id = job_postings.id").where(["save_job_buckets.freelancer_id = ?" , current_freelancer.id])
---
SELECT "job_postings".* FROM "job_postings" INNER JOIN save_job_buckets ON save_job_buckets.job_posting_id = job_postings.id WHERE (save_job_buckets.freelancer_id = 1)

        def show
                @job_posting = JobPosting.find(params[:id])
---
SELECT  "job_postings".* FROM "job_postings" WHERE "job_postings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

        def new
                @job_categories = JobCategory.all
                @project_types = ProjectType.all
                @post_visibilities = PostVisibility.all
                @no_of_freelancers = NoOfFreelancer.all
                @expertises =  Expertise.all
                @expertise_details = ExpertiseDetail.all
                @payment_types = PaymentType.all
                @project_timelines = ProjectTimeline.all
                @experience_level_hourly_rates = ExperienceLevelHourlyRate.all
---
SELECT "job_categories".* FROM "job_categories"
SELECT "project_types".* FROM "project_types"
SELECT "post_visibilities".* FROM "post_visibilities"
SELECT "no_of_freelancers".* FROM "no_of_freelancers"
SELECT "expertises".* FROM "expertises"
SELECT "expertise_details".* FROM "expertise_details" WHERE "expertise_details"."expertise_id" = $1  [["expertise_id", 10]]
SELECT "payment_types".* FROM "payment_types"
SELECT "project_timelines".* FROM "project_timelines"
SELECT "experience_level_hourly_rates".* FROM "experience_level_hourly_rates"

        def create
              #Create a new job posting.
              # @job_posting = JobPosting.find_by(current_user.id)
                print "save posting"
                  @job_posting = JobPosting.new(job_posting_params)

                  @job_posting.hirer_id = current_hirer.id
                  @job_posting.save
---
INSERT INTO "job_postings" ("job_post_title", "job_description", "project_start_date", "post_visibility_id", "payment_type_id", "project_timeline_id", "project_type_id", "job_category_id", "no_of_freelancer_id", "experience_level_hourly_rate_id", "hirer_id", "fixed_price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"